<a href="https://colab.research.google.com/github/hritikchaturvedi11/MLnow_girlscript/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:

from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
%cd '/content/drive/MyDrive/Machine Learning google colab/EDA'

/content/drive/MyDrive/Machine Learning google colab/EDA

In [7]:
ls

 bikeSharing_univeriate_linear_regression/
 Car_Price_Prediction/
 gender_submission.csv
'Parking Dataset'/
 student/
 test.csv
 train.csv
 Univeriate_linear_regression_car_price_prediction.ipynb

In [6]:
import pandas as pd
import numpy as np
import tensorflow as tf
import os
from tensorflow import keras

In [8]:
trainData = pd.read_csv('train.csv');

In [9]:
trainData.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]